import { News } from "../types/News";

export const news: News[] = [
    {
        id: 1,
        title: "В Житомирі викрили підпільну скотобійню",
        description: "На вулиці Соснову було викрито підпільну скотобійню. Бідних свиней рубали в антисанітарних умовах, а рештки зливали в річку Кам'янка. Зловмисники заплатили заслужений штраф - 511 гривень.",
        image: require('../assets/1.jpg')
    },
    {
        id: 2,
        title: "Джефрі Епштейн стоїть за киданням яйця в Януковича",
        description: "Замовником на жаль не смертельної атаки, був ажіотажний підприємець-злодій. За чутками саме Професор стоїть за вбивством Джефрі за гратами.",
        image: require('../assets/2.jpg')
    },
    {
        id: 3,
        title: "Інопланетяни підтвердили існування Барака Обами",
        description: "Провідні вчені кодеїнового гіганта Копіум підтвердили існування колишнього президента США Барака Обами. Як не дивно, він виявився землянином.",
        image: require('../assets/3.jpg')
    },
    {
        id: 4,
        title: "Індійці винайшли для себе мило",
        description: "В серпні 2025 пройшли перші випробування передових розробок Державного університету Мумбайська політехніка. Перший кандидат науки Індії прийняв ванну 19.08.2025.",
        image: require('../assets/4.jpg')
    },
    {
        id: 5,
        title: "Речі пророка Санбоя випрали поки він спав",
        description: "Поки Санбой спав, його речі випрали. Поки Санбой спав, його речі випрали. Поки Санбой спав, його речі випрали. Поки Санбой спав, його речі випрали. Поки Санбой спав, його речі випрали.",
        image: require('../assets/5.jpg')
    },
    {
        id: 6,
        title: "Казимир Казимирович Броученко провів концерт",
        description: "Андеграудна легенда провела концерт на підвалі Нижньої Польової на 103 людини. Як сповіщають очевидці це було шедеврально.",
        image: require('../assets/6.jpg')
    },
    {
        id: 7,
        title: "Саша Сімпл викрив причину уходу в інактив",
        description: "Найращий гравець в КС з України визнав, що не міг грати через свою залежність до бургерів. Геймер признав, що не міг відірватись від харчів швидкого харчування, через що опух і залишився без передніх зубів.",
        image: require('../assets/7.jpg')
    },
    {
        id: 8,
        title: "Анатолія Марцингендлера знайдено сплячим в купі сміття",
        description: "Американський філософ спав в себе вдома і був знайдений на прохання батьків. Через свою теорію 'сміття не існує' він перестав його виносити як і виходити з будинку. Батьки були у розпачі, тому і викликали поліцію.",
        image: require('../assets/8.jpg')
    },
    {
        id: 9,
        title: "Джонатан Девіс +rep",
        description: "А що тут писати? Тіп і так написав достатньо хорошої музики, щастя, здоров'я пажилому.",
        image: require('../assets/9.jpg')
    }, 
    {
        id: 10,
        title: "Дарт Вейдер готується до виборів",
        description: "Енакік Скайуокер готується очолити Україну у такі складні часи і принести їй домінацію не тільки в Східній Європі, а у всій галактиці Чумацький Шлях. Нарешті гідний кандидат - ДУМАЙТЕ!!!",
        image: require('../assets/10.jpg')
    },
]